backend/app/controllers/heros_controller.rb

    def show
        hero = Hero.find_by(id: params[:id])
---
SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def index
        heros = Hero.all
---
SELECT "heros".* FROM "heros"

    def update
        #binding.pry
        @hero = Hero.find_by(name: params[:hero][:name])
---
SELECT "heros".* FROM "heros" WHERE "heros"."name" = ? LIMIT ?  [["name", "Anti-Mage"], ["LIMIT", 1]]