backend/app/controllers/matches_controller.rb

    def create
        match = Match.create(match_params)
---
INSERT INTO "matches" ("winner", "winnerProbability", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["winner", "Radiant"], ["winnerProbability", 0.368], ["created_at", "2021-02-22 04:40:25.006798"], ["updated_at", "2021-02-22 04:40:25.006798"]]